
# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# Пример:
#-----------------------------------------------------------------------------
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
#-----------------------------------------------------------------------------

# def sum_list(list1):
#     sum = 0
#     for i in range(len(list1)):
#         if i % 2 != 0:
#             sum += list1[i]
#     print(f"Ответ: {sum}")

# list1 = [2, 3, 5, 9, 3]
# #list1 = list(map(int, input("Введите числа через пробел: ").split()))
# sum_list(list1)
#--------------------------------------------------------------------------------
# from itertools import count

# 2 вариант(записал для себя)

# count = int(input('введите кол-во элементов: '))
# some_list = []
# sum = 0
# for _ in range(count):
#     nums = int(input('введите элемент: '))
#     some_list.append(nums)
# for idx in range(1, count, 2):
#     sum += some_list[idx]
# print(f'ответ:{sum} ')

#------------------------------------------------------------------------------
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]
#-------------------------------------------------------------------------
# list1 = [2, 3, 4, 5, 6]
# list2 = [2, 3, 5, 6]
# print('Список: ' + str(list1))
# res = []
# for ele in range(0, len(list1), 2 ): 
#     res.append(list1[ele] * list1[ele - 1])
# print()
# res2 = []
# for ele in range(0, len(list2), 2 ): 
#     res2.append(list2[ele] * list2[ele - 1])

# print('Сумма пар чисел равна: ' + str(res))
# print('Сумма пар чисел равна: ' + str(res2))



# Правильный вариант 

# num = int(input('Введите кол-во элементов: '))
# some_list = []
# for _ in range(num):
#     nums = int(input())
#     some_list.append(nums)
# list1 = []
# for idx in range((num - 1)// 2 + 1):
#     nums1 = some_list[idx]
#     nums2 = some_list[num - idx - 1]
#     list1.append(nums1 * nums2)
# print(list1)

#-----------------------------------------------------------------------------

# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

# Пример:

# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19
#-----------------------------------------------------------------------------

# count = int(input('Введите кол-во элементов'))
# some_list = []
# for _ in range(count):
#     number = input()
#     some_list.append(number)
# minn = 1
# maxx = 0
# for ele in some_list:
#     if '.' in str(ele):
#         dr =str(ele).split('.')[1]
#         if float('0.' + dr) > maxx:
#             maxx = float('0.' + dr)
#         elif float('0.' + dr) < minn:
#             minn = float('0.' + dr)
# print(maxx - minn)
                    
#--------------------------------------------------------------------------    

# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

# Пример:
#--------------------------------------------------------------------------    

# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10
#--------------------------------------------------------------------------    

# number = int(input('Введите число : '))
 
# nums = ' '
 
# while number > 0:
#     nums = str(number % 2) + nums
#     number = number // 2
 
# print(nums)
#--------------------------------------------------------------------------    

# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

# Пример:
#--------------------------------------------------------------------------    
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи](https://ru.wikipedia.org/wiki/%D0%9D%D0%B5%D0%B3%D0%B0%D1%84%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8#:~:text=%D0%92%20%D0%BC%D0%B0%D1%82%D0%B5%D0%BC%D0%B0%D1%82%D0%B8%D0%BA%D0%B5%2C%20%D1%87%D0%B8%D1%81%D0%BB%D0%B0%20%D0%BD%D0%B5%D0%B3%D0%B0%D1%84%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8%20%E2%80%94%20%D0%BE%D1%82%D1%80%D0%B8%D1%86%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%20%D0%B8%D0%BD%D0%B4%D0%B5%D0%BA%D1%81%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D1%8B%D0%B5%20%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%D0%B4%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D0%B8%20%D1%87%D0%B8%D1%81%D0%B5%D0%BB%20%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8.)
#--------------------------------------------------------------------------    

# def f1(n):
#     if n in [1, 2]:                       
#         return 1
#     else:
#         return f1(n-1) + f1(n-2)

# def f2(n):
#     if n == 1:                       
#         return 1
#     else:
#         f1, f2 = 1, -1
#         for i in range(2, n):
#             f1, f2 = f2, f1 - f2
#         return f2

# list = []
# numbr = int(input('Введите число: '))
# for e in range(1, numbr + 1):
#     list.append(f1(e))
#     list.insert(0, f2(e))
# print(list)

#--------------------------------------------------------------------------    